# Recetas simples de Pandas

In [1]:
import pandas as pd
import numpy as np

## Series

In [2]:
numeros = pd.Series([1, 2, 3, 4, 5, 6, 7, 8])
numeros

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [3]:
numeros * 2

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
dtype: int64

In [4]:
numeros - (numeros * 2)

0   -1
1   -2
2   -3
3   -4
4   -5
5   -6
6   -7
7   -8
dtype: int64

In [5]:
numeros[numeros%2==0]

1    2
3    4
5    6
7    8
dtype: int64

In [6]:
def triple(x):
    return 3*x
numeros.apply(triple)

0     3
1     6
2     9
3    12
4    15
5    18
6    21
7    24
dtype: int64

## DataFrame

In [7]:
df = pd.DataFrame(np.random.rand(10,3), columns=['A', 'B', 'C'])
df

          A         B         C
0  0.143597  0.274224  0.768227
1  0.847434  0.026334  0.440844
2  0.582634  0.836903  0.872201
3  0.542245  0.543308  0.698240
4  0.242736  0.999888  0.162231
5  0.994421  0.846806  0.480835
6  0.838385  0.709377  0.428986
7  0.742423  0.897621  0.706312
8  0.434534  0.282293  0.590897
9  0.658605  0.858298  0.843310

In [8]:
df['A']

0    0.143597
1    0.847434
2    0.582634
3    0.542245
4    0.242736
5    0.994421
6    0.838385
7    0.742423
8    0.434534
9    0.658605
Name: A, dtype: float64

In [9]:
df['C'] = df['A']-df['B']

In [10]:
df[['C', 'B']]

          C         B
0 -0.130627  0.274224
1  0.821100  0.026334
2 -0.254269  0.836903
3 -0.001063  0.543308
4 -0.757152  0.999888
5  0.147614  0.846806
6  0.129008  0.709377
7 -0.155197  0.897621
8  0.152242  0.282293
9 -0.199693  0.858298

In [11]:
df[['A']]

          A
0  0.143597
1  0.847434
2  0.582634
3  0.542245
4  0.242736
5  0.994421
6  0.838385
7  0.742423
8  0.434534
9  0.658605

In [12]:
df[df['C']>0.2].A

1    0.847434
Name: A, dtype: float64

In [13]:
BIKE = pd.read_csv('./train-bike.csv')
BIKE[:10]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
5,2011-01-01 05:00:00,1,0,0,2,9.84,12.880,75,6.0032,0,1,1
6,2011-01-01 06:00:00,1,0,0,1,9.02,13.635,80,0.0000,2,0,2
7,2011-01-01 07:00:00,1,0,0,1,8.20,12.880,86,0.0000,1,2,3
8,2011-01-01 08:00:00,1,0,0,1,9.84,14.395,75,0.0000,1,7,8
9,2011-01-01 09:00:00,1,0,0,1,13.12,17.425,76,0.0000,8,6,14

In [ ]:
# FIN